; domain
(define (domain miconic)
  (:requirements :typing :strips)
  (:types passenger - object
          floor - object
         )

(:predicates 
(origin ?person - passenger ?floor - floor)
;; entry of ?person is ?floor
;; inertia

(destin ?person - passenger ?floor - floor)
;; exit of ?person is ?floor
;; inertia

(above ?floor1 - floor  ?floor2 - floor)
;; ?floor2 is located above of ?floor1

(boarded ?person - passenger)
;; true if ?person has boarded the lift

(not-boarded ?person - passenger)
;; true if ?person has not boarded the lift

(served ?person - passenger)
;; true if ?person has alighted as her destination

(not-served ?person - passenger)
;; true if ?person is not at their destination

(lift-at ?floor - floor)
;; current position of the lift is at ?floor
)


;;stop and allow boarding

(:action board
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (origin ?p ?f))
  :effect (boarded ?p))

(:action depart
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (destin ?p ?f)
		     (boarded ?p))
  :effect (and (not (boarded ?p))
	       (served ?p)))
;;drive up

(:action up
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f1 ?f2))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))


;;drive down

(:action down
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f2 ?f1))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))
)

; problem
(define (problem miconic-prob-7f-7p)
  (:domain miconic)

  (:objects
    p1 p2 p3 p4 p5 p6 p7 - passenger
    f1 f2 f3 f4 f5 f6 f7 - floor
  )

  (:init
    (origin p1 f2)
    (destin p1 f1)
    (not-boarded p1)
    (not-served p1)
    (origin p2 f2)
    (destin p2 f1)
    (not-boarded p2)
    (not-served p2)
    (origin p3 f4)
    (destin p3 f6)
    (not-boarded p3)
    (not-served p3)
    (origin p4 f7)
    (destin p4 f1)
    (not-boarded p4)
    (not-served p4)
    (origin p5 f7)
    (destin p5 f1)
    (not-boarded p5)
    (not-served p5)
    (origin p6 f2)
    (destin p6 f7)
    (not-boarded p6)
    (not-served p6)
    (origin p7 f6)
    (destin p7 f7)
    (not-boarded p7)
    (not-served p7)
    (above f1 f2)
    (above f1 f3)
    (above f1 f4)
    (above f1 f5)
    (above f1 f6)
    (above f1 f7)
    (above f2 f3)
    (above f2 f4)
    (above f2 f5)
    (above f2 f6)
    (above f2 f7)
    (above f3 f4)
    (above f3 f5)
    (above f3 f6)
    (above f3 f7)
    (above f4 f5)
    (above f4 f6)
    (above f4 f7)
    (above f5 f6)
    (above f5 f7)
    (above f6 f7)
    (lift-at f4)
  )

  (:goal (and
    (served p1)
    (served p2)
    (served p3)
    (served p4)
    (served p5)
    (served p6)
    (served p7)
  ))
)

; plan
1. (board f4 p3)
   added: (boarded p3)
   goals met: 0 of 7
2. (down f4 f2)
   deleted: (lift-at f4)
   added: (lift-at f2)
   goals met: 0 of 7
3. (board f2 p2)
   added: (boarded p2)
   goals met: 0 of 7
4. (board f2 p6)
   added: (boarded p6)
   goals met: 0 of 7
5. (board f2 p1)
   added: (boarded p1)
   goals met: 0 of 7
6. (up f2 f6)
   deleted: (lift-at f2)
   added: (lift-at f6)
   goals met: 0 of 7
7. (board f6 p7)
   added: (boarded p7)
   goals met: 0 of 7
8. (depart f6 p3)
   deleted: (boarded p3)
   added: (served p3)
   goals met: 1 of 7
9. (up f6 f7)
   deleted: (lift-at f6)
   added: (lift-at f7)
   goals met: 1 of 7
10. (depart f7 p6)
   deleted: (boarded p6)
   added: (served p6)
   goals met: 2 of 7
11. (board f7 p4)
   added: (boarded p4)
   goals met: 2 of 7
12. (board f7 p5)
   added: (boarded p5)
   goals met: 2 of 7
13. (depart f7 p7)
   deleted: (boarded p7)
   added: (served p7)
   goals met: 3 of 7
14. (down f7 f1)
   deleted: (lift-at f7)
   added: (lift-at f1)
   goals met: 3 of 7
15. (depart f1 p4)
   deleted: (boarded p4)
   added: (served p4)
   goals met: 4 of 7
16. (depart f1 p2)
   deleted: (boarded p2)
   added: (served p2)
   goals met: 5 of 7
17. (depart f1 p1)
   deleted: (boarded p1)
   added: (served p1)
   goals met: 6 of 7
18. (depart f1 p5)
   deleted: (boarded p5)
   added: (served p5)
   goals met: 7 of 7
